vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32f030/RTC_reginfo.h
/* This file is generated by stm32_reggen.py from stm32f030xc.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the RTC register metadata for the stm32f030 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
static const stm32_reginfo_t stm32_f030_rtc_reginfo[RI_END] =
{
	[RI_TR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x007F7F7F }, /* mask = 0b00000000011111110111111101111111 */
	[RI_DR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FFFF3F }, /* mask = 0b00000000111111111111111100111111 */
	[RI_CR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FFDD7F }, /* mask = 0b00000000111111111101110101111111 */
	[RI_ISR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00017DFD }, /* mask = 0b00000000000000010111110111111101 */
	[RI_PRER           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x007F7FFF }, /* mask = 0b00000000011111110111111111111111 */
	[RI_WUTR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_ALRMAR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_WPR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000000FF }, /* mask = 0b00000000000000000000000011111111 */
	[RI_SSR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_SHIFTR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x80007FFF }, /* mask = 0b10000000000000000111111111111111 */
	[RI_TSTR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x007F7F7F }, /* mask = 0b00000000011111110111111101111111 */
	[RI_TSDR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FF3F }, /* mask = 0b00000000000000001111111100111111 */
	[RI_TSSSR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_CALR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000E1FF }, /* mask = 0b00000000000000001110000111111111 */
	[RI_TAFCR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FCFF9F }, /* mask = 0b00000000111111001111111110011111 */
	[RI_ALRMASSR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0F007FFF }, /* mask = 0b00001111000000000111111111111111 */
};

